# VertexPair Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexPair Constructor
VertexPair Class See Also
---
Constructs a new VertexPair from a pair of indices in the curve loops.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public VertexPair(
	int firstVertexIdx,
	int secondVertexIdx
)
```

Visual Basic
---
```text
Public Sub New ( _
	firstVertexIdx As Integer, _
	secondVertexIdx As Integer _
)
```

Visual C++
---
```text
public:
VertexPair(
	int firstVertexIdx,
	int secondVertexIdx
)
```

# ### Parameters
firstVertexIdx
    Type: System..::..Int32
secondVertexIdx
    Type: System..::..Int32
# See Also
VertexPair Class
Autodesk.Revit.DB Namespace